---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaWeakAxis
source: html/d3ad4b40-8ef5-6136-e614-e401f0015d97.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaWeakAxis Property

Moment of Inertia about main weak axis (I).

## Syntax (C#)
```csharp
public double MomentOfInertiaWeakAxis { get; set; }
```